test_result/fio-3.28-4R5J0001-sr-1G-qd64-num1-4K-3000-WT.txt
fio-3.28-4R5J0001-read-1G-64-1-4K: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
fio-3.28
Starting 1 process
{
  "fio version" : "fio-3.28",
  "timestamp" : 1750685822,
  "timestamp_ms" : 1750685822069,
  "time" : "Mon Jun 23 21:37:02 2025",
  "jobs" : [
    {
      "jobname" : "fio-3.28-4R5J0001-read-1G-64-1-4K",
      "groupid" : 0,
      "error" : 0,
      "eta" : 2147483647,
      "elapsed" : 2,
      "job options" : {
        "name" : "fio-3.28-4R5J0001-read-1G-64-1-4K",
        "filename" : "/dev/sda",
        "rw" : "read",
        "bs" : "4K",
        "size" : "1G",
        "runtime" : "3000",
        "ioengine" : "libaio",
        "direct" : "1",
        "iodepth" : "64",
        "numjobs" : "1",
        "group_reporting" : "1",
        "ramp_time" : "0"
      },
      "read" : {
        "io_bytes" : 1073741824,
        "io_kbytes" : 1048576,
        "bw_bytes" : 865223065,
        "bw" : 844944,
        "iops" : 211236.099919,
        "runtime" : 1241,
        "total_ios" : 262144,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 2142,
          "max" : 41457,
          "mean" : 3758.962917,
          "stddev" : 919.134635,
          "N" : 262144
        },
        "clat_ns" : {
          "min" : 164838,
          "max" : 564185,
          "mean" : 298642.853188,
          "stddev" : 17335.317536,
          "N" : 262144,
          "percentile" : {
            "1.000000" : 250880,
            "5.000000" : 276480,
            "10.000000" : 280576,
            "20.000000" : 288768,
            "30.000000" : 292864,
            "40.000000" : 296960,
            "50.000000" : 296960,
            "60.000000" : 301056,
            "70.000000" : 305152,
            "80.000000" : 309248,
            "90.000000" : 317440,
            "95.000000" : 325632,
            "99.000000" : 350208,
            "99.500000" : 362496,
            "99.900000" : 391168,
            "99.950000" : 436224,
            "99.990000" : 518144
          },
          "bins" : {
            "164864" : 1,
            "173056" : 2,
            "175104" : 1,
            "177152" : 1,
            "181248" : 2,
            "183296" : 1,
            "185344" : 3,
            "187392" : 1,
            "191488" : 5,
            "193536" : 4,
            "195584" : 3,
            "197632" : 2,
            "199680" : 6,
            "201728" : 10,
            "203776" : 5,
            "205824" : 8,
            "207872" : 22,
            "209920" : 22,
            "211968" : 38,
            "214016" : 46,
            "216064" : 42,
            "218112" : 55,
            "220160" : 61,
            "222208" : 79,
            "224256" : 82,
            "226304" : 94,
            "228352" : 94,
            "230400" : 101,
            "232448" : 123,
            "234496" : 129,
            "236544" : 145,
            "238592" : 172,
            "240640" : 182,
            "242688" : 233,
            "244736" : 239,
            "246784" : 283,
            "248832" : 297,
            "250880" : 359,
            "252928" : 334,
            "254976" : 431,
            "257024" : 440,
            "259072" : 483,
            "261120" : 566,
            "264192" : 1455,
            "268288" : 2207,
            "272384" : 3678,
            "276480" : 6462,
            "280576" : 10707,
            "284672" : 16532,
            "288768" : 22463,
            "292864" : 30498,
            "296960" : 39840,
            "301056" : 40096,
            "305152" : 27854,
            "309248" : 17009,
            "313344" : 10078,
            "317440" : 6556,
            "321536" : 4790,
            "325632" : 3901,
            "329728" : 3007,
            "333824" : 2322,
            "337920" : 1779,
            "342016" : 1497,
            "346112" : 1045,
            "350208" : 802,
            "354304" : 581,
            "358400" : 429,
            "362496" : 318,
            "366592" : 264,
            "370688" : 204,
            "374784" : 120,
            "378880" : 72,
            "382976" : 56,
            "387072" : 40,
            "391168" : 23,
            "395264" : 25,
            "399360" : 14,
            "403456" : 9,
            "407552" : 9,
            "411648" : 6,
            "415744" : 11,
            "419840" : 7,
            "423936" : 8,
            "428032" : 9,
            "432128" : 15,
            "436224" : 10,
            "440320" : 9,
            "444416" : 10,
            "448512" : 10,
            "452608" : 5,
            "456704" : 5,
            "460800" : 3,
            "464896" : 9,
            "468992" : 4,
            "473088" : 6,
            "477184" : 5,
            "481280" : 3,
            "485376" : 5,
            "489472" : 3,
            "493568" : 9,
            "497664" : 3,
            "501760" : 4,
            "505856" : 2,
            "509952" : 3,
            "514048" : 3,
            "518144" : 3,
            "522240" : 4,
            "528384" : 6,
            "536576" : 4,
            "544768" : 3,
            "552960" : 4,
            "561152" : 4
          }
        },
        "lat_ns" : {
          "min" : 168272,
          "max" : 569420,
          "mean" : 302490.660168,
          "stddev" : 17320.614763,
          "N" : 262144
        },
        "bw_min" : 845080,
        "bw_max" : 845796,
        "bw_agg" : 100.000000,
        "bw_mean" : 845438.000000,
        "bw_dev" : 506.288455,
        "bw_samples" : 2,
        "iops_min" : 211270,
        "iops_max" : 211449,
        "iops_mean" : 211359.500000,
        "iops_stddev" : 126.572114,
        "iops_samples" : 2
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 1240,
      "usr_cpu" : 20.564516,
      "sys_cpu" : 78.790323,
      "ctx" : 857,
      "majf" : 0,
      "minf" : 74,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.100000,
        "32" : 0.100000,
        ">=64" : 99.975967
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.999618,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.100000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.997925,
        "500" : 98.987198,
        "750" : 0.014877,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 64,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "sda",
      "read_ios" : 239305,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 60253,
      "write_ticks" : 0,
      "in_queue" : 60253,
      "util" : 92.282697
    }
  ]
}

fio-3.28-4R5J0001-read-1G-64-1-4K: (groupid=0, jobs=1): err= 0: pid=82194: Mon Jun 23 21:37:02 2025
  read: IOPS=211k, BW=825MiB/s (865MB/s)(1024MiB/1241msec)
    slat (nsec): min=2142, max=41457, avg=3758.96, stdev=919.13
    clat (usec): min=164, max=564, avg=298.64, stdev=17.34
     lat (usec): min=168, max=569, avg=302.49, stdev=17.32
    clat percentiles (usec):
     |  1.00th=[  251],  5.00th=[  277], 10.00th=[  281], 20.00th=[  289],
     | 30.00th=[  293], 40.00th=[  297], 50.00th=[  297], 60.00th=[  302],
     | 70.00th=[  306], 80.00th=[  310], 90.00th=[  318], 95.00th=[  326],
     | 99.00th=[  351], 99.50th=[  363], 99.90th=[  392], 99.95th=[  437],
     | 99.99th=[  519]
   bw (  KiB/s): min=845080, max=845796, per=100.00%, avg=845438.00, stdev=506.29, samples=2
   iops        : min=211270, max=211449, avg=211359.50, stdev=126.57, samples=2
  lat (usec)   : 250=1.00%, 500=98.99%, 750=0.01%
  cpu          : usr=20.56%, sys=78.79%, ctx=857, majf=0, minf=74
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=825MiB/s (865MB/s), 825MiB/s-825MiB/s (865MB/s-865MB/s), io=1024MiB (1074MB), run=1241-1241msec

Disk stats (read/write):
  sda: ios=239305/0, merge=0/0, ticks=60253/0, in_queue=60253, util=92.28%